<script setup lang="ts" >
import { reactive } from "vue";

definePageMeta({
  layout: "default",
});

const texts = reactive([
  "Предварительные выводы неутешительны: современная методология разработки обеспечивает актуальность модели развития. Картельные сговоры не допускают ситуации, при которой сторонники тоталитаризма в науке призывают нас к новым свершениям, которые, в свою очередь, должны быть представлены в исключительно положительном свете.",
  "Предварительные выводы неутешительны: современная методология разработки обеспечивает актуальность модели развития. Картельные сговоры не допускают ситуации, при которой сторонники тоталитаризма в науке призывают нас к новым свершениям, которые, в свою очередь, должны быть представлены в исключительно положительном свете.",
  "Современные технологии достигли такого уровня, что сложившаяся структура организации предоставляет широкие возможности для экспериментов, поражающих по своей масштабности и грандиозности. В своём стремлении повысить качество жизни, они забывают, что сложившаяся структура организации однозначно определяет каждого участника как способного принимать собственные решения касаемо форм воздействия.",
  "Современные технологии достигли такого уровня, что сложившаяся структура организации предоставляет широкие возможности для экспериментов, поражающих по своей масштабности и грандиозности. В своём стремлении повысить качество жизни, они забывают, что сложившаяся структура организации однозначно определяет каждого участника как способного принимать собственные решения касаемо форм воздействия.",
]);
</script>

<template>
  <container tag="main" class="loyality">
    <container tag="div" class="loyality__breadcrumbs"> </container>

    <container tag="div" class="loyality__head">
      <typography
        tag="h1"
        txt="Пример заголовка. Программа лояльности"
        class="loyality__head-title"
      />

      <typography
        tag="p"
        v-for="(txt, idx) in texts"
        :key="idx"
        :txt="txt"
        class="loyality__head-txt"
      />
    </container>
  </container>
</template>

<style lang="scss" scoped>
.loyality {
  @include container;
  margin: 0 auto;
  margin-bottom: 60px;
  padding: 0 12px;
  // .loyality__breadcrumbs

  &__breadcrumbs {
    padding: 20px 12px;
  }

  // .loyality__head

  &__head {
    max-width: 600px;
    width: 100%;
  }

  // .loyality__head-title

  &__head-title {
    @include h2($white, 20px);
    word-break: break-word;
  }

  // .loyality__head-txt

  &__head-txt {
    line-height: 130%;
    font-size: 16px;
    word-break: break-word;
    margin-bottom: 30px;
    &:last-child {
      margin-bottom: 0;
    }
  }
}
</style>